__________________________________________________________________________________________________
Layer (type)                    Output Shape         Param #     Connected to                     
==================================================================================================
input_1 (InputLayer)            (None, 768, 768, 3)  0                                            
__________________________________________________________________________________________________
conv2d_1 (Conv2D)               (None, 768, 768, 32) 896         input_1[0][0]                    
__________________________________________________________________________________________________
conv2d_2 (Conv2D)               (None, 768, 768, 32) 9248        conv2d_1[0][0]                   
__________________________________________________________________________________________________
activation_1 (Activation)       (None, 768, 768, 32) 0           conv2d_2[0][0]                   
__________________________________________________________________________________________________
batch_normalization_1 (BatchNor (None, 768, 768, 32) 128         activation_1[0][0]               
__________________________________________________________________________________________________
max_pooling2d_1 (MaxPooling2D)  (None, 384, 384, 32) 0           batch_normalization_1[0][0]      
__________________________________________________________________________________________________
conv2d_3 (Conv2D)               (None, 384, 384, 64) 18496       max_pooling2d_1[0][0]            
__________________________________________________________________________________________________
conv2d_4 (Conv2D)               (None, 384, 384, 64) 36928       conv2d_3[0][0]                   
__________________________________________________________________________________________________
activation_2 (Activation)       (None, 384, 384, 64) 0           conv2d_4[0][0]                   
__________________________________________________________________________________________________
batch_normalization_2 (BatchNor (None, 384, 384, 64) 256         activation_2[0][0]               
__________________________________________________________________________________________________
max_pooling2d_2 (MaxPooling2D)  (None, 192, 192, 64) 0           batch_normalization_2[0][0]      
__________________________________________________________________________________________________
conv2d_5 (Conv2D)               (None, 192, 192, 128 73856       max_pooling2d_2[0][0]            
__________________________________________________________________________________________________
conv2d_6 (Conv2D)               (None, 192, 192, 128 147584      conv2d_5[0][0]                   
__________________________________________________________________________________________________
activation_3 (Activation)       (None, 192, 192, 128 0           conv2d_6[0][0]                   
__________________________________________________________________________________________________
batch_normalization_3 (BatchNor (None, 192, 192, 128 512         activation_3[0][0]               
__________________________________________________________________________________________________
max_pooling2d_3 (MaxPooling2D)  (None, 96, 96, 128)  0           batch_normalization_3[0][0]      
__________________________________________________________________________________________________
conv2d_7 (Conv2D)               (None, 96, 96, 256)  295168      max_pooling2d_3[0][0]            
__________________________________________________________________________________________________
conv2d_8 (Conv2D)               (None, 96, 96, 256)  590080      conv2d_7[0][0]                   
__________________________________________________________________________________________________
activation_4 (Activation)       (None, 96, 96, 256)  0           conv2d_8[0][0]                   
__________________________________________________________________________________________________
up_sampling2d_1 (UpSampling2D)  (None, 192, 192, 256 0           activation_4[0][0]               
__________________________________________________________________________________________________
conv2d_9 (Conv2D)               (None, 192, 192, 128 131200      up_sampling2d_1[0][0]            
__________________________________________________________________________________________________
concatenate_1 (Concatenate)     (None, 192, 192, 256 0           batch_normalization_3[0][0]      
                                                                 conv2d_9[0][0]                   
__________________________________________________________________________________________________
conv2d_10 (Conv2D)              (None, 192, 192, 128 295040      concatenate_1[0][0]              
__________________________________________________________________________________________________
conv2d_11 (Conv2D)              (None, 192, 192, 128 147584      conv2d_10[0][0]                  
__________________________________________________________________________________________________
activation_5 (Activation)       (None, 192, 192, 128 0           conv2d_11[0][0]                  
__________________________________________________________________________________________________
up_sampling2d_2 (UpSampling2D)  (None, 384, 384, 128 0           activation_5[0][0]               
__________________________________________________________________________________________________
conv2d_12 (Conv2D)              (None, 384, 384, 64) 32832       up_sampling2d_2[0][0]            
__________________________________________________________________________________________________
concatenate_2 (Concatenate)     (None, 384, 384, 128 0           batch_normalization_2[0][0]      
                                                                 conv2d_12[0][0]                  
__________________________________________________________________________________________________
conv2d_13 (Conv2D)              (None, 384, 384, 64) 73792       concatenate_2[0][0]              
__________________________________________________________________________________________________
conv2d_14 (Conv2D)              (None, 384, 384, 64) 36928       conv2d_13[0][0]                  
__________________________________________________________________________________________________
activation_6 (Activation)       (None, 384, 384, 64) 0           conv2d_14[0][0]                  
__________________________________________________________________________________________________
up_sampling2d_3 (UpSampling2D)  (None, 768, 768, 64) 0           activation_6[0][0]               
__________________________________________________________________________________________________
conv2d_15 (Conv2D)              (None, 768, 768, 32) 8224        up_sampling2d_3[0][0]            
__________________________________________________________________________________________________
concatenate_3 (Concatenate)     (None, 768, 768, 64) 0           batch_normalization_1[0][0]      
                                                                 conv2d_15[0][0]                  
__________________________________________________________________________________________________
conv2d_16 (Conv2D)              (None, 768, 768, 32) 18464       concatenate_3[0][0]              
__________________________________________________________________________________________________
conv2d_17 (Conv2D)              (None, 768, 768, 32) 9248        conv2d_16[0][0]                  
__________________________________________________________________________________________________
activation_7 (Activation)       (None, 768, 768, 32) 0           conv2d_17[0][0]                  
__________________________________________________________________________________________________
conv2d_18 (Conv2D)              (None, 768, 768, 1)  33          activation_7[0][0]               
==================================================================================================
Total params: 1,926,497
Trainable params: 1,926,049
Non-trainable params: 448
__________________________________________________________________________________________________
None
Epoch 1/1000
100/100 [==============================] - 196s 2s/step - loss: 0.0410 - val_loss: 0.0596

Epoch 00001: val_loss improved from inf to 0.05961, saving model to model.hdf5
Epoch 2/1000
100/100 [==============================] - 182s 2s/step - loss: 0.0353 - val_loss: 0.0413

Epoch 00002: val_loss improved from 0.05961 to 0.04133, saving model to model.hdf5
Epoch 3/1000
100/100 [==============================] - 182s 2s/step - loss: 0.0401 - val_loss: 0.0300

Epoch 00003: val_loss improved from 0.04133 to 0.03000, saving model to model.hdf5
Epoch 4/1000
100/100 [==============================] - 182s 2s/step - loss: 0.0339 - val_loss: 0.0312

Epoch 00004: val_loss did not improve from 0.03000
Epoch 5/1000
100/100 [==============================] - 182s 2s/step - loss: 0.0298 - val_loss: 0.0321

Epoch 00005: val_loss did not improve from 0.03000
Epoch 6/1000
100/100 [==============================] - 182s 2s/step - loss: 0.0405 - val_loss: 0.0655

Epoch 00006: val_loss did not improve from 0.03000
Epoch 7/1000
100/100 [==============================] - 182s 2s/step - loss: 0.0317 - val_loss: 0.0352

Epoch 00007: val_loss did not improve from 0.03000
